In [1]:
import numpy as np
import pandas as pd

In [2]:
header = ['chrom', 'pos', 'filter']
data = [4, 12345, 38.4]

In [3]:
vector = np.array(data)
print(vector)

[4.0000e+00 1.2345e+04 3.8400e+01]

In [4]:
data_dict = {'chrom': 4, 'pos': 12345, 'filter': 38.4}

In [5]:
s1 = pd.Series(data=data)

In [6]:
s1

0        4.0
1    12345.0
2       38.4
dtype: float64

In [8]:
s1 > 10

0    False
1     True
2     True
dtype: bool

In [12]:
s1[1]

12345.0

In [9]:
s2 = pd.Series(data=data, index=header)

In [10]:
s2

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [11]:
s2['pos']

12345.0

In [13]:
data = [1, '2s', 34]

In [14]:
pd.Series(data)

0     1
1    2s
2    34
dtype: object

In [15]:
pd.Series(data_dict)

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [16]:
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)

In [17]:
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [18]:
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, '234', 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)

In [19]:
s1 + s2

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [20]:
data1 = [4, 12345, 38.4]
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1)
s2 = pd.Series(data2)

s1 + s2

0        7.0
1    17244.0
2      272.4
3        NaN
dtype: float64

In [21]:
## IMPORTANT - with index labels -- operations are based on label
header1 = ['pos', 'filter', 'chrom']
data1 = [12345, 38.4, 4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [22]:
data1 = [12345, 38.4, 4]
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1)
s2 = pd.Series(data2)
s1 + s2

0    12348.0
1     4937.4
2      238.0
3        NaN
dtype: float64

In [23]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']

In [25]:

df = pd.DataFrame(data=data, columns=header)
print(df)
display(df)

   exam1  exam2  exam3
0     72     65     68
1     71     77     68
2     80     68     79
3     97     70     68

   exam1  exam2  exam3
0     72     65     68
1     71     77     68
2     80     68     79
3     97     70     68

In [26]:
df = pd.DataFrame(data=data, index=students, columns=header)
display(df)

          exam1  exam2  exam3
student1     72     65     68
student2     71     77     68
student3     80     68     79
student4     97     70     68

In [27]:
df['exam1']

student1    72
student2    71
student3    80
student4    97
Name: exam1, dtype: int32

In [28]:
df.exam1 # not a good way to do this

student1    72
student2    71
student3    80
student4    97
Name: exam1, dtype: int32

In [29]:
select_column = 'exam3'
df[select_column]

student1    68
student2    68
student3    79
student4    68
Name: exam3, dtype: int32

In [30]:
df['average'] = (df['exam1'] + df['exam2'] + df['exam3'])/3

In [31]:
display(df)

          exam1  exam2  exam3    average
student1     72     65     68  68.333333
student2     71     77     68  72.000000
student3     80     68     79  75.666667
student4     97     70     68  78.333333

In [32]:
df.drop('average') # does not work because default for drop is to work on row labels

KeyError: "['average'] not found in axis"

In [33]:
df.drop('average', axis=1) # works on column labels

          exam1  exam2  exam3
student1     72     65     68
student2     71     77     68
student3     80     68     79
student4     97     70     68

In [34]:
display(df)

          exam1  exam2  exam3    average
student1     72     65     68  68.333333
student2     71     77     68  72.000000
student3     80     68     79  75.666667
student4     97     70     68  78.333333

In [35]:
df.drop('average', axis=1, inplace=True)

In [36]:
display(df)

          exam1  exam2  exam3
student1     72     65     68
student2     71     77     68
student3     80     68     79
student4     97     70     68

In [37]:
df.drop('student3')

          exam1  exam2  exam3
student1     72     65     68
student2     71     77     68
student4     97     70     68

In [39]:
df.shape

(4, 3)

In [41]:
display(df)

          exam1  exam2  exam3
student1     72     65     68
student2     71     77     68
student3     80     68     79
student4     97     70     68

In [42]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [43]:
df['exam1']

student1    83
student2    69
student3    87
student4    94
Name: exam1, dtype: int32

In [44]:
df.loc['student1']

exam1    83
exam2    82
exam3    71
Name: student1, dtype: int32

In [45]:
df.iloc[0] ## remember that column names do not count as rows

exam1    83
exam2    82
exam3    71
Name: student1, dtype: int32

In [46]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, columns=header)

In [47]:
display(df)

   exam1  exam2  exam3
0     71     66     76
1     65     72     78
2     95     71     84
3     83     94     70

In [48]:
df.loc['student1']

KeyError: 'student1'

In [49]:
df.iloc[0]

exam1    71
exam2    66
exam3    76
Name: 0, dtype: int32

In [50]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [51]:
display(df)

          exam1  exam2  exam3
student1     75     86     77
student2     88     80     65
student3     71     73     75
student4     83     65     79

In [52]:
df.loc['student1', 'exam1']

75

In [53]:
df.loc[['student1', 'student3'], ['exam1', 'exam3']]

          exam1  exam3
student1     75     77
student3     71     75

In [54]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [55]:
df>=90

          exam1  exam2  exam3
student1  False  False  False
student2  False  False   True
student3   True  False   True
student4   True  False   True

In [56]:
df[df>=90]

          exam1  exam2  exam3
student1    NaN    NaN    NaN
student2    NaN    NaN   92.0
student3   91.0    NaN   95.0
student4   94.0    NaN   96.0

In [57]:
df['exam1']>=85

student1    False
student2     True
student3     True
student4     True
Name: exam1, dtype: bool

In [58]:
df[df['exam1']>=85] # gives all columns where exam1 is greater than 85

          exam1  exam2  exam3
student2     89     80     92
student3     91     80     95
student4     94     87     96

In [59]:
df[df['exam1']>=85]['exam3']

student2    92
student3    95
student4    96
Name: exam3, dtype: int32

In [60]:
df[df['exam1']>=85][['exam2', 'exam3']]

          exam2  exam3
student2     80     92
student3     80     95
student4     87     96

In [61]:
df[(df['exam1']>=85) & (df['exam2']>=85)]

          exam1  exam2  exam3
student4     94     87     96

In [62]:
df[(df['exam1']>=85) & (df['exam2']>=85)]['exam3']

student4    96
Name: exam3, dtype: int32

In [63]:
df[(df['exam1']>=85) | (df['exam2']>=85)]

          exam1  exam2  exam3
student2     89     80     92
student3     91     80     95
student4     94     87     96

In [64]:
df[(df['exam1']>=85) | (df['exam2']>=85)]['exam3']

student2    92
student3    95
student4    96
Name: exam3, dtype: int32

In [66]:
df[(df['exam1']>=85) | (df['exam2']>=85)]['exam3']

student2    92
student3    95
student4    96
Name: exam3, dtype: int32

In [ ]:
# & - and, | - or

In [67]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, columns=header)

In [68]:
display(df)

   exam1  exam2  exam3
0     87     72     71
1     91     84     97
2     89     74     81
3     89     72     89

In [82]:
df['name'] = students

In [83]:
display(df)

          exam1  exam2  exam3      name
name
student1     87     72     71  student1
student2     91     84     97  student2
student3     89     74     81  student3
student4     89     72     89  student4

In [84]:
df.set_index('name', inplace=True)

In [85]:
df.iloc[0]

exam1    87
exam2    72
exam3    71
Name: student1, dtype: int32

In [86]:
df.iloc[0]['exam1']
df.iloc[0][0]
df.iloc[0,0]

87

In [87]:
display(df)

          exam1  exam2  exam3
name
student1     87     72     71
student2     91     84     97
student3     89     74     81
student4     89     72     89

In [88]:
df.loc['student1']

exam1    87
exam2    72
exam3    71
Name: student1, dtype: int32

In [89]:
df.reset_index(inplace=True)

In [91]:
display(df)

       name  exam1  exam2  exam3
0  student1     87     72     71
1  student2     91     84     97
2  student3     89     74     81
3  student4     89     72     89

In [92]:
df.loc['student1']

KeyError: 'student1'

In [93]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'

In [94]:
exams = 'exam1 exam2 exam3'.split()*3

In [95]:
print(exams)

['exam1', 'exam2', 'exam3', 'exam1', 'exam2', 'exam3', 'exam1', 'exam2', 'exam3']

In [96]:
classes = 'class1 class2'

In [97]:
index = list(zip(students.split(), exams))

In [98]:
print(index)

[('student1', 'exam1'), ('student1', 'exam2'), ('student1', 'exam3'), ('student2', 'exam1'), ('student2', 'exam2'), ('student2', 'exam3'), ('student3', 'exam1'), ('student3', 'exam2'), ('student3', 'exam3')]

In [99]:
index = pd.MultiIndex.from_tuples(index)

In [100]:
display(index)

MultiIndex([('student1', 'exam1'),
            ('student1', 'exam2'),
            ('student1', 'exam3'),
            ('student2', 'exam1'),
            ('student2', 'exam2'),
            ('student2', 'exam3'),
            ('student3', 'exam1'),
            ('student3', 'exam2'),
            ('student3', 'exam3')],
           )

In [101]:
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9,2) , index, classes.split())

In [102]:
display(df)

                class1  class2
student1 exam1      93      91
         exam2      70      74
         exam3      72      86
student2 exam1      73      75
         exam2      80      96
         exam3      67      96
student3 exam1      75      77
         exam2      99      69
         exam3      75      75

In [103]:
df.loc['student1'].loc['exam1']['class1']

93

In [104]:
df.index.names

FrozenList([None, None])

In [105]:
df.index.names = ['Students', 'Exams']

In [106]:
display(df)

                class1  class2
Students Exams
student1 exam1      93      91
         exam2      70      74
         exam3      72      86
student2 exam1      73      75
         exam2      80      96
         exam3      67      96
student3 exam1      75      77
         exam2      99      69
         exam3      75      75

In [108]:
df[df<70]

                class1  class2
Students Exams
student1 exam1     NaN     NaN
         exam2     NaN     NaN
         exam3     NaN     NaN
student2 exam1     NaN     NaN
         exam2     NaN     NaN
         exam3    67.0     NaN
student3 exam1     NaN     NaN
         exam2     NaN    69.0
         exam3     NaN     NaN

In [109]:
df.xs('student1')

       class1  class2
Exams
exam1      93      91
exam2      70      74
exam3      72      86

In [110]:
df.xs('exam1', level='Exams')

          class1  class2
Students
student1      93      91
student2      73      75
student3      75      77

In [113]:
df.xs('exam3', level='Exams')

          class1  class2
Students
student1      72      86
student2      67      96
student3      75      75

In [114]:
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}

In [115]:
df = pd.DataFrame(my_dict)

In [116]:
display(df)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [117]:
df.dropna()

   student1  student2  student3
0      90.0      77.0        88

In [118]:
df.dropna(axis=0)

   student1  student2  student3
0      90.0      77.0        88

In [119]:
df.dropna(axis=1)

   student3
0        88
1        65
2        93

In [120]:
df.dropna(thresh=2)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65

In [121]:
df.fillna(value=55)

   student1  student2  student3
0      90.0      77.0        88
1      84.0      55.0        65
2      55.0      55.0        93

In [127]:
df.drop(axis=0, labels=[0, 1])

   student1  student2  student3
2       NaN       NaN        93

In [123]:
df.drop(axis=1, columns=['student1'])

   student2  student3
0      77.0        88
1       NaN        65
2       NaN        93

In [128]:
my_dict = {
    'Exams': 'exam1 exam1 exam1'.split() + 'exam2 exam2 exam2'.split() + 'exam3 exam3 exam3'.split(),
    'Students': 'student1 student2 student3'.split()*3,   
    'Scores': np.random.randint(65,101,9)
}

print(my_dict)

{'Exams': ['exam1', 'exam1', 'exam1', 'exam2', 'exam2', 'exam2', 'exam3', 'exam3', 'exam3'], 'Students': ['student1', 'student2', 'student3', 'student1', 'student2', 'student3', 'student1', 'student2', 'student3'], 'Scores': array([ 75,  87,  69,  70,  91,  99, 100,  76,  93])}

In [129]:
df = pd.DataFrame(my_dict)

In [130]:
display(df)

   Exams  Students  Scores
0  exam1  student1      75
1  exam1  student2      87
2  exam1  student3      69
3  exam2  student1      70
4  exam2  student2      91
5  exam2  student3      99
6  exam3  student1     100
7  exam3  student2      76
8  exam3  student3      93

In [131]:
df.groupby('Students').mean()

             Scores
Students
student1  81.666667
student2  84.666667
student3  87.000000

In [132]:
df.groupby('Students').mean().loc['student1']

Scores    81.666667
Name: student1, dtype: float64

In [135]:
df.groupby('Exams').max()['Scores']

Exams
exam1     87
exam2     99
exam3    100
Name: Scores, dtype: int32

In [136]:
df.groupby('Exams').describe()

      Scores
       count       mean        std   min   25%   50%   75%    max
Exams
exam1    3.0  77.000000   9.165151  69.0  72.0  75.0  81.0   87.0
exam2    3.0  86.666667  14.977761  70.0  80.5  91.0  95.0   99.0
exam3    3.0  89.666667  12.342339  76.0  84.5  93.0  96.5  100.0

In [137]:
df.groupby('Exams').groupby('Students')

AttributeError: 'DataFrameGroupBy' object has no attribute 'groupby'

In [138]:
df.groupby('Students').describe().transpose()

Students        student1   student2   student3
Scores count    3.000000   3.000000   3.000000
       mean    81.666667  84.666667  87.000000
       std     16.072751   7.767453  15.874508
       min     70.000000  76.000000  69.000000
       25%     72.500000  81.500000  81.000000
       50%     75.000000  87.000000  93.000000
       75%     87.500000  89.000000  96.000000
       max    100.000000  91.000000  99.000000

In [139]:
departments = { 
    'DepartmentId': [1, 2, 3, 4],
    'DepartmentName': ['IT', 'Physics', 'Arts', 'Math'] 
}

df1 = pd.DataFrame(departments)

In [141]:
display(df1)

   DepartmentId DepartmentName
0             1             IT
1             2        Physics
2             3           Arts
3             4           Math

In [142]:
students = {
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'StudentName': ['Michael', 'John', 'Jack', 'Sara', 'Sally', 'Jena', 'Nancy', 'Adam', 'Stevens', 'George'],
    'DepartmentId': [1, 1, 1, 2, 2, np.nan, 2, 3, 3, np.nan]
}

df2 = pd.DataFrame(students)

In [143]:
display(df2)

   StudentId StudentName  DepartmentId
0          1     Michael           1.0
1          2        John           1.0
2          3        Jack           1.0
3          4        Sara           2.0
4          5       Sally           2.0
5          6        Jena           NaN
6          7       Nancy           2.0
7          8        Adam           3.0
8          9     Stevens           3.0
9         10      George           NaN

In [144]:
marks = {
    'MarkId': [1, 2, 3, 4, 5, 6, 7, 8],
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8], 
    'Mark': [18, 20, 16, 19, 14, 20, 20, 20]
}

df3 = pd.DataFrame(marks)

In [145]:
display(df3)

   MarkId  StudentId  Mark
0       1          1    18
1       2          2    20
2       3          3    16
3       4          4    19
4       5          5    14
5       6          6    20
6       7          7    20
7       8          8    20

In [148]:
pd.merge(df2, df1, how='inner', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0          1     Michael           1.0             IT
1          2        John           1.0             IT
2          3        Jack           1.0             IT
3          4        Sara           2.0        Physics
4          5       Sally           2.0        Physics
5          7       Nancy           2.0        Physics
6          8        Adam           3.0           Arts
7          9     Stevens           3.0           Arts

In [150]:
pd.merge(df1, df2, how='inner', on='DepartmentId')

   DepartmentId DepartmentName  StudentId StudentName
0             1             IT          1     Michael
1             1             IT          2        John
2             1             IT          3        Jack
3             2        Physics          4        Sara
4             2        Physics          5       Sally
5             2        Physics          7       Nancy
6             3           Arts          8        Adam
7             3           Arts          9     Stevens

In [153]:
pd.merge(df1, df2, how='outer', on='DepartmentId')

    DepartmentId DepartmentName  StudentId StudentName
0            1.0             IT        1.0     Michael
1            1.0             IT        2.0        John
2            1.0             IT        3.0        Jack
3            2.0        Physics        4.0        Sara
4            2.0        Physics        5.0       Sally
5            2.0        Physics        7.0       Nancy
6            3.0           Arts        8.0        Adam
7            3.0           Arts        9.0     Stevens
8            4.0           Math        NaN         NaN
9            NaN            NaN        6.0        Jena
10           NaN            NaN       10.0      George

In [154]:
pd.merge(df2, df1, how='right', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0        1.0     Michael           1.0             IT
1        2.0        John           1.0             IT
2        3.0        Jack           1.0             IT
3        4.0        Sara           2.0        Physics
4        5.0       Sally           2.0        Physics
5        7.0       Nancy           2.0        Physics
6        8.0        Adam           3.0           Arts
7        9.0     Stevens           3.0           Arts
8        NaN         NaN           4.0           Math

In [155]:
pd.merge(df3, pd.merge(df2, df1, how='inner', on='DepartmentId'), how='inner', on='StudentId')

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
2       3          3    16        Jack           1.0             IT
3       4          4    19        Sara           2.0        Physics
4       5          5    14       Sally           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [156]:
data = pd.merge(df3, pd.merge(df2, df1, how='inner', on='DepartmentId'), how='inner', on='StudentId')

In [157]:
display(data)

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
2       3          3    16        Jack           1.0             IT
3       4          4    19        Sara           2.0        Physics
4       5          5    14       Sally           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [158]:
data[['StudentName', 'Mark', 'DepartmentName']]

  StudentName  Mark DepartmentName
0     Michael    18             IT
1        John    20             IT
2        Jack    16             IT
3        Sara    19        Physics
4       Sally    14        Physics
5       Nancy    20        Physics
6        Adam    20           Arts

In [172]:
d1 = {
    'C0': ['C0R0', 'C0R1', 'C0R2'],
    'C1': ['C1R0', 'C1R1', 'C2R2'],
    'C2': ['C2R0', 'C2R1', 'C2R2'],
}

df1 = pd.DataFrame(d1)

In [173]:
display(df1)

     C0    C1    C2
0  C0R0  C1R0  C2R0
1  C0R1  C1R1  C2R1
2  C0R2  C2R2  C2R2

In [174]:
d2 = {
    'C0': ['C0R3', 'C0R4', 'C0R5'],
    'C1': ['C1R3', 'C1R4', 'C1R5'],
    'C2': ['C2R3', 'C2R4', 'C2R5'],
}

df2 = pd.DataFrame(d2)
display(df2)

     C0    C1    C2
0  C0R3  C1R3  C2R3
1  C0R4  C1R4  C2R4
2  C0R5  C1R5  C2R5

In [175]:
d3 = {
    'C0': ['C0R6', 'C0R7', 'C0R8'],
    'C1': ['C1R6', 'C1R7', 'C1R8'],
    'C2': ['C2R6', 'C2R7', 'C2R8'],
}

df3 = pd.DataFrame(d3)

df = pd.concat([df1, df2, df3])
display(df)

     C0    C1    C2
0  C0R0  C1R0  C2R0
1  C0R1  C1R1  C2R1
2  C0R2  C2R2  C2R2
0  C0R3  C1R3  C2R3
1  C0R4  C1R4  C2R4
2  C0R5  C1R5  C2R5
0  C0R6  C1R6  C2R6
1  C0R7  C1R7  C2R7
2  C0R8  C1R8  C2R8

In [176]:
df.iloc[8]

C0    C0R8
C1    C1R8
C2    C2R8
Name: 2, dtype: object

In [170]:
## Concatenation -- Fix index

d1 = {
    'C0': ['COR0', 'COR1', 'COR2'],
    'C1': ['C1R0', 'C1R1', 'C2R2'],
    'C2': ['C2R0', 'C2R1', 'C2R2'],
}

df1 = pd.DataFrame(d1, index=[1, 2, 3])

d2 = {
    'C0': ['C0R3', 'C0R4', 'C0R5'],
    'C1': ['C1R3', 'C1R4', 'C1R5'],
    'C2': ['C2R3', 'C2R4', 'C2R5'],
}

df2 = pd.DataFrame(d2, index=[4, 5, 6])

d3 = {
    'C0': ['C0R6', 'C0R7', 'C0R8'],
    'C1': ['C1R6', 'C1R7', 'C1R8'],
    'C2': ['C2R6', 'C2R7', 'C2R8'],
}

df3 = pd.DataFrame(d3, index=[7, 8, 9])

pd.concat([df1, df2, df3])

     C0    C1    C2
1  COR0  C1R0  C2R0
2  COR1  C1R1  C2R1
3  COR2  C2R2  C2R2
4  C0R3  C1R3  C2R3
5  C0R4  C1R4  C2R4
6  C0R5  C1R5  C2R5
7  C0R6  C1R6  C2R6
8  C0R7  C1R7  C2R7
9  C0R8  C1R8  C2R8

In [177]:
pd.concat([df1, df2, df3], axis=1)

     C0    C1    C2    C0    C1    C2    C0    C1    C2
0  C0R0  C1R0  C2R0  C0R3  C1R3  C2R3  C0R6  C1R6  C2R6
1  C0R1  C1R1  C2R1  C0R4  C1R4  C2R4  C0R7  C1R7  C2R7
2  C0R2  C2R2  C2R2  C0R5  C1R5  C2R5  C0R8  C1R8  C2R8

In [178]:
data['DepartmentName']

0         IT
1         IT
2         IT
3    Physics
4    Physics
5    Physics
6       Arts
Name: DepartmentName, dtype: object

In [179]:
data['DepartmentName'].unique() # SELECT DISTINCT DepartmentName From Departments

array(['IT', 'Physics', 'Arts'], dtype=object)

In [180]:
data['DepartmentName'].nunique()  # SELECT DISTINCT count(DepartmentName) From Departments

3

In [181]:
data['DepartmentName'].value_counts() 
# SELECT DepartmentName, count(DepartmentName) From Departments GROUP BY DepartmentName

Physics    3
IT         3
Arts       1
Name: DepartmentName, dtype: int64

In [182]:
data[data['Mark']>17]

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
3       4          4    19        Sara           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [183]:
data['Mark']

0    18
1    20
2    16
3    19
4    14
5    20
6    20
Name: Mark, dtype: int64

In [184]:
data['Mark']*5

0     90
1    100
2     80
3     95
4     70
5    100
6    100
Name: Mark, dtype: int64

In [185]:
def times5(val):
    return val * 5

data['Mark'].apply(times5)

0     90
1    100
2     80
3     95
4     70
5    100
6    100
Name: Mark, dtype: int64

In [186]:
data['Mark'].apply(lambda val: val*5)

0     90
1    100
2     80
3     95
4     70
5    100
6    100
Name: Mark, dtype: int64

In [187]:
data['Mark'].apply(lambda val: f'Grade: {val*5}')

0     Grade: 90
1    Grade: 100
2     Grade: 80
3     Grade: 95
4     Grade: 70
5    Grade: 100
6    Grade: 100
Name: Mark, dtype: object

In [188]:
def upper(string):
    return string.upper()

data['DepartmentName'].apply(upper)

0         IT
1         IT
2         IT
3    PHYSICS
4    PHYSICS
5    PHYSICS
6       ARTS
Name: DepartmentName, dtype: object

In [189]:
data['DepartmentName'].apply(lambda string: string.upper())

0         IT
1         IT
2         IT
3    PHYSICS
4    PHYSICS
5    PHYSICS
6       ARTS
Name: DepartmentName, dtype: object

In [190]:
mapping = {18: 'B', 14: 'C', 19: 'A-', 20: 'A+'}

In [193]:
display(data['Mark'])
data['Mark'].map(mapping)

0    18
1    20
2    16
3    19
4    14
5    20
6    20
Name: Mark, dtype: int64

0      B
1     A+
2    NaN
3     A-
4      C
5     A+
6     A+
Name: Mark, dtype: object

In [194]:
data.columns

Index(['MarkId', 'StudentId', 'Mark', 'StudentName', 'DepartmentId',
       'DepartmentName'],
      dtype='object')

In [195]:
data.drop(['StudentId', 'MarkId' , 'DepartmentId'], axis=1)['']

   Mark StudentName DepartmentName
0    18     Michael             IT
1    20        John             IT
2    16        Jack             IT
3    19        Sara        Physics
4    14       Sally        Physics
5    20       Nancy        Physics
6    20        Adam           Arts